import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-description',
  templateUrl: './description.component.html',
  styleUrls: ['./description.component.css']
})
export class DescriptionComponent implements OnInit {

  description = 'ในปัจจุบันเทคโนโลยีมีบทบาทต่อชีวิตเป็นอย่างมาก เช่นเดียวกันอาชีพด้านเทคโนโลยีก็เป็นที่นิยมมากขึ้น' +
    'จึงทำให้ปัจจุบันมีนักเรียนที่ต้องการ เข้าศึกษาต่อในสาขาที่เกี่ยวข้องกับเทคโนโลยีเพิ่มมากขึ้น ' +
    'แต่ด้วยความที่สายงานทางเทคโนโลยีนั้นมีหลากหลายสาขา จนทำให้บางครั้งน้องๆ ' +
    'นักเรียนที่อยากศึกษาต่อด้านนี้ สับสนไม่แน่ใจว่าควรเลือกเรียนเรียนสาขาไหนที่ตรงกับความถนัด และความต้องการของตัวเอง ' +
    'จีงเกิดเป็นคำถามมากมายบนโลกโซเชียล เกี่ยวกับการเตรียมตัว การเลิอกสาขา รวมถึงควรเลือกมหาวิทยาลัยไหน ที่จะทำให้สามารถต่อยอดการทำงานในสายอาชีพนี้ได้ ' +
    'โครงการนี้จึงเกิดขึ้นเพื่อให้คำแนะนำ ให้แนวทาง การเตรียมตัว ความเชื่อมั่นที่จะตัดสินใจเลือกสาขาวิชา และมหาวิทยาลัยที่จะเข้าศึกษาต่อในงานด้านเทคโนโลยี';
  objectives = [
    'เพื่อให้ผู้เข้าอบรมมีแนวทางในการเลือกและตัดสินใจเข้าศึกษาต่อในสาขาด้านเทคโนโลยีที่ตนเองสนใจ',
    'เพื่อให้ผู้เข้าอบรมมีแรงบันดาลใจและมุ่งมั่นในการเข้าศึกษาต่อในสาขาวิชาด้านเทคโนโลยี',
    'เพื่อให้ผู้เข้าอบรม ได้เรียนรู้ ทำความเข้าใจเทคโนโลยีที่ตนสนใจเบื้องต้น และได้ลงมือปฎิบัติจริงจาก Workshop'
  ];

  constructor() { }

  ngOnInit(): void {
  }

}
